tutorials/pimpleHFDIBFoam/Immersed_Cyl_Oscillating/ImmersedCyl-Sinusoidal-Re39-Mesh901120/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}

libs
(
    "libfvMotionSolvers.so"
    "libmeshTools.so"
);

application     pimpleHFDIBFoam;

startFrom       startTime;
startTime       0;

stopAt          endTime;
endTime         8;

deltaT          0.00125;

writeControl    timeStep;
writeInterval   40;

purgeWrite      0;

writeFormat     ascii;
writePrecision  8;
writeCompression off;

timeFormat      general;
timePrecision   8;

runTimeModifiable true;

adjustTimeStep  no;
maxCo           1;
// ************************************************************************* //
